var questions = [
	{
		quesText: "Ккому первому обратились за помощью дед и бабка, не справившись с репкой?",
		answers: ["К Жучке",
		"К дочке",
		"К внучке",
		"К мышке"],
		rightAns: 2
	},
	{
		quesText: "Как называется ближайшая к Земле звезда?",
		answers: ["Проксиома Центавра",
		"Солнце",
		"Полярная",
		"Сириус"],
		rightAns: 1
	},
	{
		quesText: "Кто первым вышел в открытый космос?",
		answers: ["Титов",
		"Николаев",
		"Леонов",
		"Феактистов"],
		rightAns: 2
	},
	{
		quesText: "Кто расследовал убийство в 'Восточном экспрессе'?",
		answers: [ "Пуаро",
		"Мисс Марпл",
		"Пинкертон",
		"Холмс"],
		rightAns: 0
	},
	{
		quesText: "Какой из этих фильмов снят по пьесе Лопе де Вега?",
		answers: ["'Учитель танцев'",
		"'Учитель пения'",
		"'Сельская учительница'",
		"'Первый учитель'"],
		rightAns: 0
	},
	{
		quesText: "Кто озвучивал Шарика в мультфильме про Простоквашино?",
		answers: ["Анофриев",
		"Дуров",
		"Табаков",
		"Вицин"],
		rightAns: 1
	},
	{
		quesText: "Пахарь в старину назывался",
		answers: ["Ратай",
		"Холоп",
		"Гридь",
		"Смерд"],
		rightAns: 0
	},
	{
		quesText: "Какая спортивная команда представляла добровольное спортивное общество профсоюзов?",
		answers: ["Динамо",
		"Торпедо",
		"ЦСКА",
		"Спартак"],
		rightAns: 3
	},
	{
		quesText: "Какой из этих городов расположен не на Рейне?",
		answers: ["Кельн",
		"Страсбург",
		"Дортмунд",
		"Бонн"],
		rightAns: 2
	},
	{
		quesText: "Как называется первый сборник стихов В. Высоцкого?",
		answers: ["'Нерв'",
		"'Боль'",
		"'Охота на воков'",
		"'Гамлет'"],
		rightAns: 0
	},
	{
		quesText: "Отец солнца и огня это",
		answers: ["Ярило",
		"Мокошь",
		"Велес",
		"Сварог"],
		rightAns: 3
	},
	{
		quesText: "Шкала Сковилла - это школа оценки",
		answers: ["Качества атмосферного воздуха",
		"Привлекательности женщин",
		"Остроты перца",
		"Уровня моря"],
		rightAns: 2
	},
	{
		quesText: "Какой титул имел Дон Кихот?",
		answers: ["Барон",
		"Маркиз",
		"Идальго",
		"Вождь"],
		rightAns: 2
	},
	{
		quesText: "Как называется самая глубокая точка поверхности Земли, находящаяся на дне Марианской впадины?",
		answers: ["Филиппинская плита",
		"Бездна Челленджера",
		"Кермадек",
		"Черное логово"],
		rightAns: 1
	},
	{
		quesText: "Кто автор антиутопического романа 'Одивный новый мир'",
		answers: ["Олдос Хаксли",
		"Рэй Брэдбери",
		"Джордж Оруэлл",
		"Самерсет Моэм"],
		rightAns: 0
	}
];

var cash = [
	100, 200, 300, 500, 1000, 2000, 4000, 8000, 16000, 32000, 64000, 125000, 250000, 500000, 1000000
];

var ansLetters=["A","B","C","D"];